Get intermediate color entries (other than the minimum and maximum settings).
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public IList<AnalysisDisplayColorEntry> GetIntermediateColors()
  Visual Basic
Public Function GetIntermediateColors As IList(Of AnalysisDisplayColorEntry)
  Visual C++
public:
IList<AnalysisDisplayColorEntry^>^ GetIntermediateColors()
 Return Value
 Array of intermediate color entries.
 See Also
  AnalysisDisplayColorSettings Class
  Autodesk.Revit.DB.Analysis Namespace